app/controllers/api/v1/tasks_controller.rb

INSERT INTO "tasks" ("name", "tag", "status", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "do X"], ["tag", "yellow"], ["status", false], ["slug", "do-x"], ["created_at", "2022-01-25 11:16:26.071286"], ["updated_at", "2022-01-25 11:16:26.071286"]]
---
                task = Task.new(task_params)

                if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "tag" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["tag", "1999"], ["updated_at", "2022-01-25 15:06:48.657669"], ["id", 2]]
---
                task = Task.find(params[:id])

                if task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."slug" IS NULL LIMIT $1  [["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
                task = Task.find_by(slug: params[:slug])

                if task.destroy